In [1]:
import pandas as pd
import numpy as np

In [7]:
from numpy.random import randn

In [8]:
np.random.seed(101)

In [58]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [10]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [11]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [13]:
#lets not ust this method of calling a column
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [14]:
df['new'] = df['W'] + df['Z']

In [15]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [19]:
df2 = df.drop('new', axis=1)

In [26]:
df = df.drop('E')

In [21]:
df2

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [28]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752

In [31]:
#here we see that rows are 0 and cols are 1 in position
df.shape

(4, 5)

In [32]:
#selecting ROWs
#2 ways.  for each one we need to call a Method

df.loc['A']
#this returns a serise

W      2.706850
X      0.628133
Y      0.907969
Z      0.503826
new    3.210676
Name: A, dtype: float64

In [33]:
#the second way uses an Index position
df.iloc[2]

W     -2.018168
X      0.740122
Y      0.528813
Z     -0.589001
new   -2.607169
Name: C, dtype: float64

In [34]:
#selecting subsets of rows and columns
#df.loc['row','col']
df.loc['B', 'Y']

-0.8480769834036315

In [35]:
df.loc[ ['A','B'] , ['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [36]:
# conditional selection 
df > 0

       W      X      Y      Z    new
A   True   True   True   True   True
B   True  False  False   True   True
C  False   True   True  False  False
D   True  False  False   True   True

In [37]:
booldf = df> 0

In [38]:
booldf

       W      X      Y      Z    new
A   True   True   True   True   True
B   True  False  False   True   True
C  False   True   True  False  False
D   True  False  False   True   True

In [39]:
df[booldf]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118       NaN       NaN  0.605965  1.257083
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057  1.143752

In [40]:
df[df>0]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118       NaN       NaN  0.605965  1.257083
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057  1.143752

In [41]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752

In [42]:
df['W'] > 0

A     True
B     True
C    False
D     True
Name: W, dtype: bool

In [43]:
df[df['W']>0]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
D  0.188695 -0.758872 -0.933237  0.955057  1.143752

In [44]:
resultdf = df[df['W']>0]

In [45]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
Name: X, dtype: float64

In [46]:
# We can do the above all in one step

df[df['W'] > 0]['X']

A    0.628133
B   -0.319318
D   -0.758872
Name: X, dtype: float64

In [48]:
df[df['W'] > 0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237

In [49]:
# What if you wanted multiple conditions
 # This will not work --> df[(df['W']>0) and (df['Y'] < 1)]   because of the 'and' operater, here we use &

#for and use & 

df[(df['W']>0) & (df['Y'] < 1)]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
D  0.188695 -0.758872 -0.933237  0.955057  1.143752

In [50]:
#for 'or' use | 'pipe'
 
df[(df['W']>0) | (df['Y'] < 1)]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752

In [52]:
# How to reset the index. use inplace=True to set it inplace
df.reset_index()

  index         W         X         Y         Z       new
0     A  2.706850  0.628133  0.907969  0.503826  3.210676
1     B  0.651118 -0.319318 -0.848077  0.605965  1.257083
2     C -2.018168  0.740122  0.528813 -0.589001 -2.607169
3     D  0.188695 -0.758872 -0.933237  0.955057  1.143752

In [55]:
#to make a new index or set a new index 
newind = 'CA NY WY OR CO'.split()

In [56]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [59]:
#Make this a Col in the df
df['States'] = newind

In [60]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

In [62]:
df.set_index('States', inplace=True)

In [63]:
df

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652

In [65]:
df.reset_index(inplace = True)

In [66]:
df

  States         W         X         Y         Z
0     CA  0.302665  1.693723 -1.706086 -1.159119
1     NY -0.134841  0.390528  0.166905  0.184502
2     WY  0.807706  0.072960  0.638787  0.329646
3     OR -0.497104 -0.754070 -0.943406  0.484752
4     CO -0.116773  1.901755  0.238127  1.996652

In [67]:
# Multi-index

In [71]:
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = '1 2 3 1 2 3'.split()

In [72]:
list(zip(outside, inside))

[('G1', '1'), ('G1', '2'), ('G1', '3'), ('G2', '1'), ('G2', '2'), ('G2', '3')]

In [73]:
hier_index = list(zip(outside, inside))

In [76]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [77]:
hier_index

MultiIndex([('G1', '1'),
            ('G1', '2'),
            ('G1', '3'),
            ('G2', '1'),
            ('G2', '2'),
            ('G2', '3')],
           )

In [78]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [79]:
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [81]:
df.loc['G1']

          A         B
1 -0.993263  0.196800
2 -1.136645  0.000366
3  1.025984 -0.156598

In [83]:
df.loc['G1'].loc['1']

A   -0.993263
B    0.196800
Name: 1, dtype: float64

In [84]:
df.loc['G1'].iloc[0]

A   -0.993263
B    0.196800
Name: 1, dtype: float64

In [88]:
# Notice tht iloc dosen't work as expected for trying to get G1
df.iloc[0]

A   -0.993263
B    0.196800
Name: (G1, 1), dtype: float64

In [89]:
df.index.names

FrozenList([None, None])

In [90]:
df.index.names = ["Groups", "Numbers"]

In [91]:
df.index.names

FrozenList(['Groups', 'Numbers'])

In [92]:
df

                       A         B
Groups Numbers
G1     1       -0.993263  0.196800
       2       -1.136645  0.000366
       3        1.025984 -0.156598
G2     1       -0.031579  0.649826
       2        2.154846 -0.610259
       3       -0.755325 -0.346419

In [96]:
df.iloc[:4,0]

Groups  Numbers
G1      1         -0.993263
        2         -1.136645
        3          1.025984
G2      1         -0.031579
Name: A, dtype: float64

In [98]:
df.loc['G2'].loc['2']['B']

-0.6102588558227414

In [106]:
# returns a cross section of rows and data frames.  this will let us get all o the values of a secondary index

df.xs('1', level = 'Numbers')

               A         B
Groups
G1     -0.993263  0.196800
G2     -0.031579  0.649826